PH_data/alpha_0.75/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
14418
(
( 0.003510715906 2.341524805e-06 6.29655915e-06 )
( 0.003407194512 1.726667278e-06 6.444212431e-06 )
( 0.006401023827 4.247262495e-06 1.134827289e-05 )
( 0.006551955827 3.211267085e-06 1.118175169e-05 )
( 0.003663954558 7.213596405e-07 2.027503797e-06 )
( 0.0120618064 1.015181715e-05 1.714193058e-05 )
( 0.01215239335 1.343960321e-05 1.568922016e-05 )
( 0.007075544447 2.221726618e-06 6.541392395e-06 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
