PH_data/alpha_0.75/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/




FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hill
    {
        type            wall;
        inGroups        1(wall);
        nFaces          708;
        startFace       43743;
    }
    top-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          272;
        startFace       44451;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          21938;
        startFace       44723;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          21938;
        startFace       66661;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          47;
        startFace       88599;
        matchTolerance  9.999999747e-05;
        transform       translational;
        neighbourPatch  cyclicAMI_inlet;
        separationVector ( -6.75 0 0 );
        lowWeightCorrection 0.009999999776;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          50;
        startFace       88646;
        matchTolerance  9.999999747e-05;
        transform       translational;
        neighbourPatch  cyclicAMI_outlet;
        separationVector ( 6.75 0 0 );
        lowWeightCorrection 0.009999999776;
    }
)

// ************************************************************************* //
